In [1]:
import pandas as pd

In [2]:
# Dataset 1: df1
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4, 5],
    'Name': ['John Doe', 'Jane Smith', 'Mike Brown', 'Emily Davis', 'Anna White'],
    'Age': [28, 34, 45, 29, 31],
    'Salary': [50000, 60000, 55000, 70000, 48000],
    'Department': ['HR', 'IT', 'Marketing', 'IT', 'HR']
})

# Dataset 2: df2
df2 = pd.DataFrame({
    'ID': [1, 2, 3, 4, 5],
    'Name': ['John Doe', 'Jane Smith', 'Mike Brown', 'Emily Davis', 'Anna White'],
    'Age': [29, 34, 46, 29, 32],
    'Salary': [50000, 62000, 54000, 72000, 48000],
    'Department': ['HR', 'IT', 'Marketing', 'IT', 'Sales']
})

# Display the DataFrames
print("DataFrame 1 (df1):")
print(df1)
print("\nDataFrame 2 (df2):")
print(df2)

DataFrame 1 (df1):
   ID         Name  Age  Salary Department
0   1     John Doe   28   50000         HR
1   2   Jane Smith   34   60000         IT
2   3   Mike Brown   45   55000  Marketing
3   4  Emily Davis   29   70000         IT
4   5   Anna White   31   48000         HR

DataFrame 2 (df2):
   ID         Name  Age  Salary Department
0   1     John Doe   29   50000         HR
1   2   Jane Smith   34   62000         IT
2   3   Mike Brown   46   54000  Marketing
3   4  Emily Davis   29   72000         IT
4   5   Anna White   32   48000      Sales

In [4]:
# Compare the two DataFrames
comparison = df1.compare(df2)

# Display the comparison result
print("\nComparison Result:")
comparison

Comparison Result:

    Age         Salary          Department
   self other     self    other       self  other
0  28.0  29.0      NaN      NaN        NaN    NaN
1   NaN   NaN  60000.0  62000.0        NaN    NaN
2  45.0  46.0  55000.0  54000.0        NaN    NaN
3   NaN   NaN  70000.0  72000.0        NaN    NaN
4  31.0  32.0      NaN      NaN         HR  Sales

### Explanation
`Comparison:` The compare() function will show differences between df1 and df2. For each cell where values differ, it will display the old and new values.

`Note: ` The compare() function requires both DataFrames to have the same shape and column names. If there are discrepancies, you may need to align the DataFrames before using compare().